# Lesson 6

In [1]:
# Import libraries
import pandas as pd
import sys

print('Python version ' + sys.version)
print('Pandas version ' + pd.__version__)

Python version 2.7.13 |Anaconda 4.4.0 (x86_64)| (default, Dec 20 2016, 23:05:08)
[GCC 4.2.1 Compatible Apple LLVM 6.0 (clang-600.0.57)]
Pandas version 0.20.1

In [2]:
# Create small data set
d = {'one':[1,1,1,1,1],
     'two':[2,2,2,2,2],
     'letter':['a', 'a', 'b', 'b', 'c']}

df = pd.DataFrame(d)
df

  letter  one  two
0      a    1    2
1      a    1    2
2      b    1    2
3      b    1    2
4      c    1    2

In [5]:
# Create group object
one = df.groupby('letter')
# Apply sum function
one.sum()

        one  two
letter
a         2    4
b         2    4
c         1    2

In [11]:
# @AY me trying it out...
d2 = {'name':['john','john','mike', 'luke'],
     'age' :[12,23,45,6],
     'likes-chicken':[True, True, False, True]}
df2 = pd.DataFrame(d2)
df2

   age  likes-chicken  name
0   12           True  john
1   23           True  john
2   45          False  mike
3    6           True  luke

In [18]:
names = df2.groupby('name')
names.sum()

      age  likes-chicken
name
john   35            2.0
luke    6            1.0
mike   45            0.0

In [19]:
letterone = df.groupby(['letter', 'one']).sum()
letterone

            two
letter one
a      1      4
b      1      4
c      1      2

In [20]:
letterone.index

MultiIndex(levels=[[u'a', u'b', u'c'], [1]],
           labels=[[0, 1, 2], [0, 0, 0]],
           names=[u'letter', u'one'])

In [22]:
letterone = df.groupby(['letter', 'one'], as_index=False).sum()
letterone

  letter  one  two
0      a    1    4
1      b    1    4
2      c    1    2

In [23]:
letterone.index

Int64Index([0, 1, 2], dtype='int64')